In [2]:
import pymysql as py
print ("done")

done

In [2]:
import pymysql as py
conn = py.connect(user = 'root',
           password = '123456789',
           host = 'localhost',
           autocommit = True) #use to autocommit the python coammand into sql database

print ("Mubarak ho connection ho gaya.......")

Mubarak ho connection ho gaya.......

now we make cursor. Help for executing the code in sql

In [7]:
cur= conn.cursor()
print ("Cursor is created")

Cursor is created

In [3]:
q1= ''' create database day5;'''
cur.execute(q1)
print("Data Base Created")

Data Base Created

In [8]:
q='''use day5;'''
cur.execute(q)
print("Done")

Done

In [5]:
q2= '''create table s_details(
SID int not null,
S_Name varchar(50),
S_Course varchar(50),
Address varchar(50));'''
cur.execute(q2)
print ("done")

done

In [7]:
# inserting data 
q= '''insert into s_details values(
057,"Divyanshu","BCA","Delhi");'''
cur.execute(q)
print ("Data Enter successfully")

Data Enter successfully

In [11]:
for i in range (5):
    sid= int(input("Enter Student id : "))
    name=input('Enter student name : ')
    course= input('Enter course : ')
    address= input('Enter address : ')
    q=f'''insert into s_details values ({sid},'{name}','{course}','{address}');'''
    cur.execute(q)
print ("data Enter")

data Enter

In [9]:
q3="select * from s_details;"
cur.execute(q3)
a=[]
for i in cur.description:
    a.append(i[0])
    # print(i)
r=cur.fetchall()
import pandas as pd 
pd.DataFrame(r,columns=a)

   SID     S_Name S_Course         Address
0   57  Divyanshu      BCA           Delhi
1  100     farhan      BCA           Delhi
2    1        dev     BCOM       janakpuri
3    2     monkey      BCA  IITM Janakpuri
4    3       abhi      BBA           delhi
5    4       divu     BCOM          dwarka
6    5     anjali      BBA       janakpuri

In [4]:
def show_rec(db,table):
    q3=f'''select * from {db}.{table};'''
    cur.execute(q3)
    a=[]
    for i in cur.description:
        a.append(i[0])
        # print(i)
    r=cur.fetchall()
    import pandas as pd 
    rec=pd.DataFrame(r,columns=a)
    return rec

In [10]:
show_rec("day5","s_details")

   SID     S_Name S_Course         Address
0   57  Divyanshu      BCA           Delhi
1  100     farhan      BCA           Delhi
2    1        dev     BCOM       janakpuri
3    2     monkey      BCA  IITM Janakpuri
4    3       abhi      BBA           delhi
5    4       divu     BCOM          dwarka
6    5     anjali      BBA       janakpuri

In [ ]:
conn.close()